package homework_15;

public class Homework_15 {
	public static void main(String[] args) {
// 1
		System.out.println("Baku Moskow Kirovsk");
//2
		System.out.println("Я изучаю Java");
		System.out.print("Я изучаю Java");
		System.out.printf("Я изучаю Java");
//3
		
	System.out.println("Бабушка язык программвирования жава нужен для создания приложений ! А твой телефон это лишь как обычная машина для запуска . Мы пишем код для программ чтобы создавать приложения , а именно такие как Ватсап Телеграмм и так далее . ");
//	4
	System.out.println("1 код написанный разработчиком.");
	System.out.println("2 компилятор переводит текст в байт-код");
	System.out.println("3 Виртальная машина которая запускает код");
//	5
	System.out.println("https://4pda.to/devdb/xiaomi_mi8");
//	6
	System.out.println("Придумай бытовую аналогию: чем похожи «исходный код» и «рецепт блюда» или «ноты и исполнение оркестром». Напиши 3–4 предложения. - Могу сказать с точностью что онги все пишуться текстом . Их можно читать .");
// 7
	System.out.println(" ne znayu :(");
//	8
	System.out.println(" ne znayu :(");
//	9
	System.out.println("Java 5 (Порядок в деталях): Раньше робот мог случайно положить колесо туда, где должна быть крыша. В 5-й версии он научился сортировать детали. Теперь на коробках написано «Только для окон», и робот больше ничего не путает.\r\n"
			+ "\r\n"
			+ "Java 8 (Супер-скорость): Раньше, чтобы покрасить 100 заборов, робот подходил к каждому по очереди. Теперь у него появились длинные руки-щупальца. Он может красить сразу много заборов одним движением. Это очень экономит время!\r\n"
			+ "\r\n"
			+ "Java 9 (Рюкзак с кармашками): Раньше инструменты робота валялись в одной куче. Теперь у него появился умный рюкзак. Если ему нужно забить гвоздь, он открывает кармашек «Молотки» и не вываливает на пол все остальные инструменты.\r\n"
			+ "\r\n"
			+ "Java 17 (Секретный замок): Робот научился делать особые детали, которые подходят только к его постройкам. Другие роботы не могут их забрать или сломать. Это как пароль на любимом планшете.");
//	10
	System.out.println("Написанный код работает на любой операциоке , Программа делаеться из объектов он такжзеж объединяющих данные и методы, что упрощает управление сложным кодом , Система сама удаляет ненужные объекты, освобождая память, что предотвращает ошибки , имбовая проверка , Java компилирует код в машинные инструкции во время исполнения, делая работу быстрой.");

// 11
System.out.println("по моему мнению жава больше строже так как в жаваскрипте запускаеться код с ошибками но работает только что написано правильно в коде а жаве в пример программист написал 100 строк кода и если в этих стах строках есть ошибка даже если одна весь код не сработает !!!");
	 
	}
}
