package homework_16;

public class Homework_16 {
	public static void main(String[] args) {
		System.out.println(
				"Написание игры требует полного набора инструментов — JDK . Он включает в себя компилятор, который переводит твой код в понятный компьютеру формат, и инструменты.\r\n"
						+ "Запуск игры требует только JRE . Это движок, который содержит виртуальную машину (JVM) и библиотеки, нужные для работы игры, но не для её создания.\r\n"
						+ "В процессе написания ты используешь JDK чтобы превратить текст программы в набор файлов");
		System.out
				.println("java version \"26\" 2026-03-17\r\n" + "Java(TM) SE Runtime Environment (build 26+35-2893)\r\n"
						+ "Java HotSpot(TM) 64-Bit Server VM (build 26+35-2893, mixed mode, sharing)");
		System.out.println("javac 26");
		System.out.println("Версия Java: Corretto 21 (LTS)\r\n"
				+ "ОС: Windows 10+, macOS 10.15+, Linux (Amazon Linux, Ubuntu, Debian, RHEL)\r\n"
				+ "Готовый установщик: Да (для всех перечисленных ОС есть .msi, .pkg или пакеты менеджеров)");
		System.out.println(
				"1написание кода 2жавак компилирует код (JDK) 3JRE принимает код 4JVM выполняет байт код делает из кода машинный код и выполнянет прогу");
		System.out.println(
				"Дистрибутив (JDK) 	Лицензия (для учебы)	Наличие MSI/EXE (Windows)	Рекомендуемая LTS (2026)\r\n"
						+ "Eclipse Temurin	GPLv2+CE (Бесплатно)	Да (MSI/EXE)	21 или 25\r\n"
						+ "Amazon Corretto	GPLv2+CE (Бесплатно)	Да (MSI)	21 или 25\r\n"
						+ "Oracle JDK	NFTC (Бесплатно для обучения)	Да (EXE)");
		System.out.println(
				"нужно удалить папку с жава ждк и скачать новую а с версией надо зайти в командную строку и ввести java -version");
		System.out.println(
				"\"C:\\jdk-26_windows-x64_bin.exe\" это бин а к папке не могу зайти так как проблема с диском");
		System.out.println("скрин");
		System.out.println("проблема не могу сделать");
		System.out.println("\"JAVA_HOME\" не является внутренней или внешней\r\n"
				+ "командой, исполняемой программой или пакетным файлом. ( скорее всего из за того что я не установил прогу так как проблемиа с диском"
				+ "");
	System.out.println("Выполниться старый !");
	System.out.println("Плюсы пользовательских переменных (\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "):\r\n"
			+ " Не требуются права администратора для настройки.\r\n"
			+ " Переменные влияют только на текущего пользователя, не ломая Java в других профилях.\r\n"
			+ " Легко менять версии Java под конкретные учебные проекты без влияния на систему." );
	System.out.println("Плюсы системных переменных (\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "):\r\n"
			+ " Java доступна всем пользователям и службам на компьютере.\r\n"
			+ " Уменьшает риск случайного удаления пути при смене пользователя.\r\n"
			+ " Удобно для серверных приложений, запускаемых от имени системы");
	System.out.println("export PATH=\"\"\r\n"
			+ "");
	
	}
}
